var col = 12; //每行12箱子
var level = 3; //初始关卡为第一关
var goalList = [4, 3, 4, 4, 3, 5, 5, 6, 5, 4]; //每关箱子数量
var origin = [54, 15, 39, 29, 17, 21, 45, 94, 39, 56]; //每关初始皮卡丘的位置
var goal = goalList[level]; //本关箱子数量
var position = origin[level]; //本关皮卡丘出生位置

var map = [
    //地图
    [
        0, 0, 0, 0, 3, 3, 3, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 3, 1, 3, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 3, 2, 3, 3, 3, 3, 0, 0,
        0, 0, 3, 3, 3, 4, 2, 4, 1, 3, 0, 0,
        0, 0, 3, 1, 2, 4, 2, 3, 3, 3, 0, 0,
        0, 0, 3, 3, 3, 3, 4, 3, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 3, 1, 3, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 3, 3, 3, 0, 0, 0, 0
    ],
    [
        0, 0, 3, 3, 3, 3, 3, 0, 0, 0, 0, 0,
        0, 0, 3, 2, 2, 2, 3, 0, 0, 0, 0, 0,
        0, 0, 3, 2, 4, 4, 3, 0, 3, 3, 3, 0,
        0, 0, 3, 2, 4, 2, 3, 0, 3, 1, 3, 0,
        0, 0, 3, 3, 3, 2, 3, 3, 3, 1, 3, 0,
        0, 0, 0, 3, 3, 2, 2, 2, 2, 1, 3, 0,
        0, 0, 0, 3, 2, 2, 2, 3, 2, 2, 3, 0,
        0, 0, 0, 3, 2, 2, 2, 3, 3, 3, 3, 0,
        0, 0, 0, 3, 3, 3, 3, 3, 0, 0, 0, 0
    ],
    [
        0, 0, 3, 3, 3, 3, 3, 3, 3, 0, 0, 0,
        0, 0, 3, 2, 2, 2, 2, 2, 3, 3, 3, 0,
        0, 3, 3, 4, 3, 3, 3, 2, 2, 2, 3, 0,
        0, 3, 2, 2, 2, 4, 2, 2, 4, 2, 3, 0,
        0, 3, 2, 1, 1, 3, 2, 4, 2, 3, 3, 0,
        0, 3, 3, 1, 1, 3, 2, 2, 2, 3, 0, 0,
        0, 0, 3, 3, 3, 3, 3, 3, 3, 3, 0, 0
    ],
    [
        0, 0, 0, 0, 3, 3, 3, 3, 0, 0, 0, 0,
        0, 0, 0, 3, 3, 2, 2, 3, 0, 0, 0, 0,
        0, 0, 0, 3, 2, 2, 4, 3, 0, 0, 0, 0,
        0, 0, 0, 3, 3, 2, 2, 3, 3, 0, 0, 0,
        0, 0, 0, 3, 3, 4, 4, 2, 3, 0, 0, 0,
        0, 0, 0, 3, 1, 4, 2, 2, 3, 0, 0, 0,
        0, 0, 0, 3, 1, 1, 2, 1, 3, 0, 0, 0,
        0, 0, 0, 3, 3, 3, 3, 3, 3, 0, 0, 0
    ],
    [
        0, 0, 0, 3, 3, 3, 3, 3, 0, 0, 0, 0,
        0, 0, 0, 3, 2, 2, 3, 3, 3, 0, 0, 0,
        0, 0, 0, 3, 2, 4, 2, 2, 3, 0, 0, 0,
        0, 0, 3, 3, 3, 2, 3, 2, 3, 3, 0, 0,
        0, 0, 3, 1, 3, 2, 3, 2, 2, 3, 0, 0,
        0, 0, 3, 1, 4, 2, 2, 3, 2, 3, 0, 0,
        0, 0, 3, 1, 2, 2, 2, 4, 2, 3, 0, 0,
        0, 0, 3, 3, 3, 3, 3, 3, 3, 3, 0, 0
    ],
    [
        0, 0, 0, 0, 3, 3, 3, 3, 3, 3, 3, 0,
        0, 0, 0, 3, 3, 2, 2, 3, 2, 2, 3, 0,
        0, 0, 0, 3, 2, 2, 2, 3, 2, 2, 3, 0,
        0, 0, 0, 3, 4, 2, 4, 2, 4, 2, 3, 0,
        0, 0, 0, 3, 2, 4, 3, 3, 2, 2, 3, 0,
        0, 3, 3, 3, 2, 4, 2, 3, 2, 3, 3, 0,
        0, 3, 1, 1, 1, 1, 1, 2, 2, 3, 0, 0,
        0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 0, 0
    ],
    [
        0, 0, 0, 0, 3, 3, 3, 3, 3, 3, 0, 0,
        0, 0, 3, 3, 3, 2, 2, 2, 2, 3, 0, 0,
        0, 3, 3, 1, 2, 4, 3, 3, 2, 3, 3, 0,
        0, 3, 1, 1, 4, 2, 4, 2, 2, 2, 3, 0,
        0, 3, 1, 1, 2, 4, 2, 4, 2, 3, 3, 0,
        0, 3, 3, 3, 3, 3, 3, 2, 2, 3, 0, 0,
        0, 0, 0, 0, 0, 0, 3, 3, 3, 3, 0, 0
    ],
    [
        0, 0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 0,
        0, 0, 3, 2, 2, 3, 3, 2, 2, 2, 3, 0,
        0, 0, 3, 2, 2, 2, 4, 2, 2, 2, 3, 0,
        0, 0, 3, 4, 2, 3, 3, 3, 2, 4, 3, 0,
        0, 0, 3, 2, 3, 1, 1, 1, 3, 2, 3, 0,
        0, 3, 3, 2, 3, 1, 1, 1, 3, 2, 3, 3,
        0, 3, 2, 4, 2, 2, 4, 2, 2, 4, 2, 3,
        0, 3, 2, 2, 2, 2, 2, 3, 2, 2, 2, 3,
        0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3
    ],
    [
        0, 0, 0, 0, 3, 3, 3, 3, 3, 3, 0, 0,
        0, 0, 0, 0, 3, 2, 2, 2, 2, 3, 0, 0,
        0, 0, 3, 3, 3, 4, 4, 4, 2, 3, 0, 0,
        0, 0, 3, 2, 2, 4, 1, 1, 2, 3, 0, 0,
        0, 0, 3, 2, 4, 1, 1, 1, 3, 3, 0, 0,
        0, 0, 3, 3, 3, 3, 2, 2, 3, 0, 0, 0,
        0, 0, 0, 0, 0, 3, 3, 3, 3, 0, 0, 0
    ],
    [
        0, 0, 3, 3, 3, 3, 0, 0, 3, 3, 3, 3,
        3, 3, 3, 2, 2, 3, 0, 0, 3, 2, 2, 2,
        3, 3, 2, 4, 2, 3, 3, 3, 3, 4, 2, 2,
        3, 3, 2, 2, 4, 1, 1, 1, 1, 2, 4, 2,
        3, 3, 3, 2, 2, 2, 2, 3, 2, 2, 2, 3,
        3, 0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3
    ]
];


var box = $('.box div');
//创建地图
function create() {
    box.each(function (index) {
        box.eq(index).removeClass(); //清除上关数据
    });
    box.each(function (index, element) {
        if (map[level][index]) { 
            box.eq(index).addClass('type' + map[level][index]);
        }
    });
    box.eq(position).addClass("player");
};
create();

//触发移动
$('#top').click(function () {
    move(-col);
    setTimeout(win, 100);
});
$('#bottom').click(function () {
    move(col);
    setTimeout(win, 100);
});
$('#left').click(function () {
    move(-1);
    setTimeout(win, 100);
});
$('#right').click(function () {
    move(1);
    setTimeout(win, 100);
});

//玩家移动
function move(step) {
    var player1 = box.eq(position); //当前位置
    var player2 = box.eq(position + step); //移动后位置
    var pushbox = box.eq(position + step * 2); //箱子移动后位置
    //普通移动
    if (player2.hasClass('type2') || (player2.hasClass('type1') && !player2.hasClass('type4'))) {
        player1.removeClass('player');
        player2.addClass('player');
        position = position + step;

        //推箱子移动
    } else if (player2.hasClass('type4') && (pushbox.hasClass('type2') || (pushbox.hasClass('type1') && !pushbox.hasClass('type4')))) {
        //玩家目的地有箱子  且  (箱子目的地是路  或  箱子目的地是目的地且没有箱子)
        player2.removeClass("type4");
        player1.removeClass("player");
        pushbox.addClass("type4").removeClass('type2');
        player2.addClass("player").addClass("type2");
        position = position + step;
    } 
}

//过关
function win() {
    if ($('.type1.type4').length === goal) {
        if (level<9) {
            alert('哎呦,不错哦');
            level++;
            position = origin[level];
            goal = goalList[level];
            create();
        }else{
            alert('你还真他娘的是个人才');
        }        
    }   
}
